3-rails-sort-index/app/controllers/movies_controller.rb

  def index
    if params[:sort] == 'title'
      @movies = Movie.order(:title)
    elsif params[:sort] == 'r_date'
      @movies = Movie.order(:release_date)
    else
      @movies = Movie.all
---
SELECT "movies".* FROM "movies" ORDER BY "movies"."title" ASC
SELECT "movies".* FROM "movies" ORDER BY "movies"."release_date" ASC
SELECT "movies".* FROM "movies"