6-rails-oauth/app/controllers/application_controller.rb

SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."uid" = ? ORDER BY "moviegoers"."id" ASC LIMIT ?  [["uid", 166038795], ["LIMIT", 1]]
---
	def set_current_user
		@current_user ||= Moviegoer.where(uid: session[:user_id]).first # assegna solo se @current_user è null