6-rails-oauth/app/controllers/reviews_controller.rb

  def create
    @review = Review.new(review_params)
    @m = Movie.where(:id => params[:movie_id]).first
    @mg = Moviegoer.where(:uid => session[:user_id]).first

    @m.reviews << @review
    @mg.reviews << @review
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? ORDER BY "movies"."id" ASC LIMIT ?  [["id", 7], ["LIMIT", 1]]
SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."uid" = ? ORDER BY "moviegoers"."id" ASC LIMIT ?  [["uid", 27], ["LIMIT", 1]]
INSERT INTO "reviews" ("potatoes", "comments", "moviegoer_id", "movie_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["potatoes", 1], ["comments", "Amazing movie!"], ["moviegoer_id", 3], ["movie_id", 7], ["created_at", "2024-04-10 16:48:15.208378"], ["updated_at", "2024-04-10 16:48:15.208378"]]

  def has_moviegoer_and_movie
    unless @current_user
      flash[:warning] = 'You must be logged in to create a review.'
      redirect_to movies_path
    end
    unless (@movie = Movie.where(:id => params[:movie_id]).first)
---
SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? ORDER BY "movies"."id" ASC LIMIT ?  [["id", 7], ["LIMIT", 1]]