2-rails-intro/rottenpotatoes/app/models/movie.rb

    def self.cancella(title)
        Movie.where(title: title).delete_all
---
DELETE FROM "movies" WHERE "movies"."title" = ?  [["title", "Aladdin"]]