4-rails-session_5-rails-associations/app/controllers/application_controller.rb

	def set_current_user
		# we exploit the fact that the below query may return nil
		session[:user_id] = 27
		@current_user ||= Moviegoer.where(:uid => session[:user_id]).first
---
SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."uid" = ? ORDER BY "moviegoers"."id" ASC LIMIT ?  [["uid", 27], ["LIMIT", 1]]