4-rails-session_5-rails-associations/app/controllers/moviegoers_controller.rb

  def index
    @moviegoers = Moviegoer.all
---
SELECT "moviegoers".* FROM "moviegoers"

  def create
    @moviegoer = Moviegoer.new(moviegoer_params)

    respond_to do |format|
      if @moviegoer.save
---
INSERT INTO "moviegoers" ("uid", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["uid", 43], ["name", "Pierpu"], ["created_at", "2024-04-10 15:09:20.540197"], ["updated_at", "2024-04-10 15:09:20.540197"]]

    def set_moviegoer
      @moviegoer = Moviegoer.find(params[:id])
---
SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]