7-rails-authorization/app/controllers/cats_controller.rb

INSERT INTO "cats" ("nome", "colore", "eta", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["nome", "Pierpu"], ["colore", "Blu"], ["eta", 2], ["created_at", "2024-05-16 19:43:22.524273"], ["updated_at", "2024-05-16 19:43:22.524273"]]
---
  def create
    @cat = Cat.new(cat_params)

    respond_to do |format|
      if @cat.save

DELETE FROM "cats" WHERE "cats"."id" = ?  [["id", 1]]
---
  def destroy
    @cat.destroy

SELECT "cats".* FROM "cats" WHERE "cats"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
    def set_cat
      @cat = Cat.find(params[:id])