7-rails-authorization/app/controllers/movies_controller.rb

  def create
    @movie = Movie.new(movie_params)
    authorize! :create, @movie, :message => "BEWARE: you are not authorized to create new movies."

    respond_to do |format|
      if @movie.save
---
INSERT INTO "movies" ("title", "rating", "description", "release_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @movie.update(movie_params)
---
UPDATE "movies" SET "description" = ?, "updated_at" = ? WHERE "movies"."id" = ?  [["description", "Test"], ["updated_at", "2023-05-01 21:19:37.493736"], ["id", 1]]

  def destroy
    authorize! :destroy, @movie, :message => "BEWARE: you are not authorized to destroy movies."
    @movie.destroy
---
DELETE FROM "movies" WHERE "movies"."id" = ?  [["id", 4]]