6-rails-oauth/app/models/moviegoer.rb

INSERT INTO "moviegoers" ("uid", "name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["uid", 166038795], ["name", "Benny"], ["created_at", "2024-05-12 17:21:56.602182"], ["updated_at", "2024-05-12 17:21:56.602182"]]
SELECT "moviegoers".* FROM "moviegoers" WHERE "moviegoers"."uid" = ? ORDER BY "moviegoers"."id" ASC LIMIT ?  [["uid", 166038795], ["LIMIT", 1]]
---
    def self.from_omniauth(auth)
        where(uid: auth.uid).first_or_create do |moviegoer|