2-rails-intro/rottenpotatoes/app/controllers/movies_controller.rb

INSERT INTO "movies" ("title", "rating", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "Mulan"], ["rating", "5 Stelle"], ["description", "Bello"], ["created_at", "2024-03-12 16:48:57.445109"], ["updated_at", "2024-03-12 16:48:57.445109"]]
---
  def create
    @movie = Movie.new(movie_params)

    respond_to do |format|
      if @movie.save

SELECT "movies".* FROM "movies" WHERE "movies"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
---
  def destroy
    @movie = Movie.find(params[:id])